app/controllers/books_controller.rb

  def index
    @books = Book.all
---
SELECT "books".* FROM "books" ORDER BY "books"."created_at" DESC

  def create
    @book = Book.new(book_params)
    if @book.save
      flash[:success] = 'Book was successfully created.'
      redirect_to "/books/#{@book.id}"
    else
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "s"], ["body", "s"], ["created_at", "2021-12-13 02:18:55.572449"], ["updated_at", "2021-12-13 02:18:55.572449"]]
SELECT "books".* FROM "books" ORDER BY "books"."created_at" DESC

  def destroy
    book = Book.find(params[:id])
    if book.destroy
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 25], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 25]]